# Taps
tap "homebrew/bundle"
tap "nikitabobko/tap"
tap "FelixKratz/formulae"

# Shell + core
brew "bash"
brew "bash-completion@2"
brew "coreutils"
brew "findutils"
brew "gnu-sed"
brew "gawk"
brew "git"
brew "gh"
brew "git-delta"
brew "tmux"
brew "starship"
brew "mise"
brew "fzf"
brew "ripgrep"
brew "fd"
brew "eza"
brew "bat"
brew "jq"
brew "tree"
brew "wget"
brew "zoxide"
brew "gum"
brew "ffmpeg"
brew "imagemagick"

# Dev tools
brew "neovim"
brew "lazygit"
brew "lazydocker"
brew "btop"
brew "fastfetch"
brew "node"
brew "python@3.12"

# Window manager + helpers
cask "aerospace"
cask "raycast"
cask "hammerspoon"
brew "sketchybar"
brew "borders"

# Terminals
cask "ghostty"
cask "alacritty"
cask "kitty"

# Apps from Hyprland config
cask "google-chrome"
cask "spotify"
cask "signal"
cask "obsidian"
cask "1password"
cask "cursor"

# Fonts
cask "font-caskaydia-mono-nerd-font"
cask "font-caskaydia-cove-nerd-font"
